{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
    },
    "post_processor": {
        "type": "ByteLevel",
        "add_prefix_space": true,
        "trim_offsets": false,
        "use_regex": true
    },
    "decoder": {
        "type": "ByteLevel",
        "add_prefix_space": true,
        "trim_offsets": true,
        "use_regex": true
    },
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": null,
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "vocab": {
            "<pad>": 0,
            "IsCircum": 1,
            "bus": 2,
            "*": 3,
            "uation": 4,
            "Perpen": 5,
            "OfSector": 6,
            "en": 7,
            "or": 8,
            "OfArc": 9,
            "9": 10,
            "{": 11,
            ",": 12,
            "goal_cdl": 13,
            "Pow": 14,
            "dicular": 15,
            "Mul": 16,
            "Shape": 17,
            "IsIn": 18,
            "pezoid": 19,
            "Mirr": 20,
            "MirrorSimilarBetween": 21,
            "MirrorSimilar": 22,
            "Point": 23,
            "ngentOfCircle": 24,
            "tion": 25,
            "centerOf": 26,
            "j": 27,
            "entBetween": 28,
            "MirrorSimilarBetweenTriangle": 29,
            "a": 30,
            "Cent": 31,
            "r": 32,
            "IsTa": 33,
            "IsoscelesRightTriangle": 34,
            "W": 35,
            "IsMedian": 36,
            "LengthOfLine": 37,
            "rc": 38,
            "6": 39,
            "[": 40,
            "EquilateralTriangle": 41,
            "c": 42,
            "um": 43,
            "1": 44,
            "age": 45,
            ".": 46,
            "SimilarBetweenTriangle": 47,
            "Mod": 48,
            "ra": 49,
            "ape": 50,
            "f": 51,
            "IsAltitudeOfQuadrilateral": 52,
            "Cocircular": 53,
            "n": 54,
            "Or": 55,
            "X": 56,
            "Radi": 57,
            "sq": 58,
            "roid": 59,
            "J": 60,
            "ce": 61,
            "IsMidpoint": 62,
            "rimeterOf": 63,
            "Ad": 64,
            "ri": 65,
            "|": 66,
            "m": 67,
            "tu": 68,
            "g": 69,
            "Is": 70,
            "CongruentBetweenTriangle": 71,
            "Polygon": 72,
            "s": 73,
            "PerimeterOfSector": 74,
            "Tri": 75,
            "7": 76,
            "x": 77,
            "P": 78,
            "reOfCircle": 79,
            "ly": 80,
            "gra": 81,
            "xt": 82,
            "Sq": 83,
            "IsMidsegmentOfTriangle": 84,
            "zoid": 85,
            "E": 86,
            "ular": 87,
            "HeightOfQuadrilateral": 88,
            ">": 89,
            "Be": 90,
            "Pe": 91,
            "Rh": 92,
            "Bisector": 93,
            "lar": 94,
            "angle": 95,
            "Le": 96,
            "er": 97,
            "i": 98,
            "IsBisectorOfAngle": 99,
            "ng": 100,
            "terOf": 101,
            "text": 102,
            "Sector": 103,
            "Congru": 104,
            "OfQuadrilateral": 105,
            "RatioOf": 106,
            "q": 107,
            "Parallelogra": 108,
            "IsoscelesTrapezoid": 109,
            "ngle": 110,
            "ll": 111,
            "Add": 112,
            "Coll": 113,
            "OfTriangle": 114,
            "construction": 115,
            "Eq": 116,
            "Rhombus": 117,
            "IsIncenterOfQuadrilateral": 118,
            "tio": 119,
            "goal": 120,
            "_": 121,
            "ure": 122,
            "Triangle": 123,
            "re": 124,
            "BetweenLine": 125,
            "construction_cdl": 126,
            "PerimeterOfTriangle": 127,
            "Quadrilateral": 128,
            "ngent": 129,
            "b": 130,
            "d": 131,
            "os": 132,
            "He": 133,
            "A": 134,
            "AreaOfQuadrilateral": 135,
            "Sh": 136,
            "ParallelBetweenLine": 137,
            "usOfCircle": 138,
            "RatioOfMirrorSimilarTriangle": 139,
            "Q": 140,
            "text_cdl": 141,
            "Di": 142,
            "Sin": 143,
            "G": 144,
            "\\": 145,
            "MirrorCongruentBetween": 146,
            "Area": 147,
            "ector": 148,
            "Kite": 149,
            "in": 150,
            "IsCentroidOfTriangle": 151,
            ")": 152,
            "Ki": 153,
            "_cdl": 154,
            "V": 155,
            "sector": 156,
            "S": 157,
            "ru": 158,
            "C": 159,
            "Circ": 160,
            "ua": 161,
            "IsCentreOfCircle": 162,
            "gh": 163,
            "Circle": 164,
            "4": 165,
            "lateral": 166,
            "MirrorSimilarBetweenQuadrilateral": 167,
            "Mi": 168,
            "OfAngle": 169,
            "Si": 170,
            "F": 171,
            "Par": 172,
            "im": 173,
            "een": 174,
            "rt": 175,
            "Co": 176,
            "Val": 177,
            "N": 178,
            "dri": 179,
            "y": 180,
            "<": 181,
            "IsCircumcenterOfTriangle": 182,
            "ameterOf": 183,
            "ag": 184,
            "Betw": 185,
            "IsTangentOfCircle": 186,
            "IsMidsegmentOfQuadrilateral": 187,
            "titu": 188,
            "2": 189,
            "IsCircumcenterOfQuadrilateral": 190,
            "8": 191,
            "Ta": 192,
            "p": 193,
            "IsMedianOfTriangle": 194,
            "co": 195,
            "IsDiameterOfCircle": 196,
            "IsCirc": 197,
            "IsPerpendicular": 198,
            "ent": 199,
            "DiameterOfCircle": 200,
            "H": 201,
            "ter": 202,
            "thocenterOfTriangle": 203,
            "Right": 204,
            "dian": 205,
            "IsCentroid": 206,
            "Meas": 207,
            "Similar": 208,
            "allel": 209,
            "/": 210,
            "SimilarBetween": 211,
            "IsMid": 212,
            "RightTriangle": 213,
            "Are": 214,
            "inear": 215,
            "\"": 216,
            "Sub": 217,
            "Arc": 218,
            "Quadri": 219,
            "AreaOfTriangle": 220,
            "ilar": 221,
            "U": 222,
            "ilateral": 223,
            "ngru": 224,
            "DiameterOf": 225,
            "T": 226,
            "OfLine": 227,
            "3": 228,
            "Me": 229,
            "Cocirc": 230,
            "milar": 231,
            "~": 232,
            "MeasureOfAngle": 233,
            "Z": 234,
            "RightTrapezoid": 235,
            "Mu": 236,
            "IsMidpointOfArc": 237,
            "Height": 238,
            "Ratio": 239,
            "IsBisector": 240,
            "centerOfQuadrilateral": 241,
            "Y": 242,
            "0": 243,
            "L": 244,
            "Perpendicular": 245,
            "}": 246,
            "w": 247,
            "rr": 248,
            "irc": 249,
            "**": 250,
            "seg": 251,
            "RatioOfMirrorSimilar": 252,
            "SimilarBetweenQuadrilateral": 253,
            "^": 254,
            "ment": 255,
            "RatioOfSimilarTriangle": 256,
            "Rect": 257,
            "IsMidseg": 258,
            "gon": 259,
            "Po": 260,
            "SimilarBetweenArc": 261,
            "t": 262,
            "Qua": 263,
            "Isosceles": 264,
            "-": 265,
            "Trapezoid": 266,
            "later": 267,
            "e": 268,
            "lel": 269,
            "ar": 270,
            "IsMe": 271,
            "Mirror": 272,
            "IsAl": 273,
            "HeightOfTriangle": 274,
            "Mo": 275,
            "AreaOfCircle": 276,
            "Al": 277,
            "pe": 278,
            "'": 279,
            "cons": 280,
            "ngth": 281,
            "Of": 282,
            "Parallelogram": 283,
            "te": 284,
            "celes": 285,
            "MirrorCongruentBetweenQuadrilateral": 286,
            "Line": 287,
            "Equal": 288,
            "pen": 289,
            "=": 290,
            "IsoscelesTriangle": 291,
            "th": 292,
            "D": 293,
            "IsMi": 294,
            "an": 295,
            "IsPerpendicularBisectorOfLine": 296,
            "z": 297,
            "al": 298,
            "Tra": 299,
            "IsMidsegment": 300,
            "(": 301,
            "Cos": 302,
            "Value": 303,
            "cdl": 304,
            "point": 305,
            "centerOfTriangle": 306,
            "In": 307,
            "RatioOfSimilarQuadrilateral": 308,
            "Poly": 309,
            "Su": 310,
            "h": 311,
            "LengthOfArc": 312,
            "oint": 313,
            "k": 314,
            "Length": 315,
            "Per": 316,
            "IsOrthocenterOfTriangle": 317,
            "oid": 318,
            "IsAltitude": 319,
            "IsCent": 320,
            "Measure": 321,
            "RadiusOfCircle": 322,
            "Parallel": 323,
            "Angle": 324,
            "`": 325,
            "MeasureOfArc": 326,
            "tw": 327,
            "sqrt": 328,
            "o": 329,
            "RatioOfSimilar": 330,
            "les": 331,
            "IsMidpointOfLine": 332,
            "Sqrt": 333,
            "RatioOfSimilarArc": 334,
            "go": 335,
            ";": 336,
            "RatioOfMirrorSimilarQuadrilateral": 337,
            "cd": 338,
            "Rectangle": 339,
            "la": 340,
            "ine": 341,
            "Between": 342,
            "CongruentBetween": 343,
            "Ra": 344,
            "ct": 345,
            "l": 346,
            "truction": 347,
            "CongruentBetweenArc": 348,
            "CongruentBetweenQuadrilateral": 349,
            "O": 350,
            "mbus": 351,
            "M": 352,
            "Equilateral": 353,
            "eg": 354,
            "Bi": 355,
            "oin": 356,
            "IsAltitu": 357,
            "ue": 358,
            "PerimeterOfCircle": 359,
            "Equation": 360,
            "cular": 361,
            "id": 362,
            "igh": 363,
            "IsAltitudeOfTriangle": 364,
            "+": 365,
            "5": 366,
            "Tan": 367,
            "di": 368,
            "as": 369,
            "PerpendicularBetweenLine": 370,
            "ogra": 371,
            "IsOr": 372,
            "R": 373,
            "uare": 374,
            "eterOf": 375,
            "ns": 376,
            "le": 377,
            "Collinear": 378,
            "MirrorCongruentBetweenTriangle": 379,
            "image_cdl": 380,
            "v": 381,
            "ect": 382,
            "de": 383,
            "ti": 384,
            "Equ": 385,
            "AreaOfSector": 386,
            "ight": 387,
            "PerimeterOf": 388,
            ":": 389,
            "Square": 390,
            "I": 391,
            "circ": 392,
            "Isos": 393,
            "IsIncenterOfTriangle": 394,
            "tru": 395,
            "OfCircle": 396,
            "B": 397,
            "Div": 398,
            "]": 399,
            "u": 400,
            "ction": 401,
            "K": 402,
            "PerimeterOfQuadrilateral": 403,
            "cen": 404,
            "BisectorOfLine": 405,
            "us": 406,
            "image": 407,
            "meterOf": 408,
            "ocenterOfTriangle": 409,
            "ombus": 410,
            "<unk>": 411,
            "<start>": 412,
            "<end>": 413,
            "<sep>": 414
        },
        "merges": [
            "O f",
            "r i",
            "l e",
            "n g",
            "e n",
            "e r",
            "l a",
            "t er",
            "ng le",
            "I s",
            "a ngle",
            "T ri",
            "Tri angle",
            "a l",
            "r c",
            "u a",
            "la ter",
            "later al",
            "Q ua",
            "d ri",
            "Qua dri",
            "Quadri lateral",
            "la r",
            "B e",
            "e en",
            "t w",
            "Be tw",
            "Betw een",
            "ter Of",
            "S i",
            "M i",
            "i rc",
            "i lar",
            "m ilar",
            "o r",
            "en t",
            "Si milar",
            "C irc",
            "i n",
            "r e",
            "t i",
            "Circ le",
            "A rc",
            "C o",
            "R a",
            "e terOf",
            "m eterOf",
            "r r",
            "Of Triangle",
            "Mi rr",
            "in e",
            "ti o",
            "Mirr or",
            "L ine",
            "r u",
            "c t",
            "c en",
            "e ct",
            "g h",
            "i gh",
            "ng ru",
            "ent Between",
            "Similar Between",
            "Co ngru",
            "Ra tio",
            "cen terOf",
            "igh t",
            "Congru entBetween",
            "Ratio Of",
            "A re",
            "P e",
            "d i",
            "i d",
            "o id",
            "r a",
            "Of Quadrilateral",
            "Of Circle",
            "ri meterOf",
            "Is Mi",
            "ect or",
            "Are a",
            "Pe rimeterOf",
            "IsMi d",
            "p e",
            "M e",
            "R ight",
            "T ra",
            "c e",
            "o s",
            "t h",
            "z oid",
            "Of Arc",
            "Of Line",
            "le s",
            "Is os",
            "centerOf Triangle",
            "RatioOf Similar",
            "pe zoid",
            "Tra pezoid",
            "ce les",
            "Isos celes",
            "A ngle",
            "D i",
            "a r",
            "o in",
            "u lar",
            "oin t",
            "A l",
            "B i",
            "C ent",
            "E q",
            "H e",
            "I n",
            "L e",
            "P er",
            "P ar",
            "S ector",
            "a s",
            "a meterOf",
            "c d",
            "c ular",
            "d e",
            "e g",
            "m ent",
            "p en",
            "p oint",
            "s ector",
            "s eg",
            "t u",
            "u m",
            "u s",
            "u re",
            "Of Angle",
            "le l",
            "ng th",
            "Is Circ",
            "Is Al",
            "Is Cent",
            "Is In",
            "al lel",
            "Between Line",
            "ti tu",
            "Mirror Similar",
            "Mirror SimilarBetween",
            "Mirror CongruentBetween",
            "centerOf Quadrilateral",
            "RatioOf MirrorSimilar",
            "di cular",
            "IsMid point",
            "IsMid seg",
            "Me as",
            "Right Triangle",
            "Di ameterOf",
            "Bi sector",
            "He ight",
            "Le ngth",
            "Per pen",
            "Par allel",
            "cd l",
            "_ cdl",
            "IsCirc um",
            "IsAl titu",
            "IsMidseg ment",
            "Meas ure",
            "DiameterOf Circle",
            "Perpen dicular",
            "IsAltitu de",
            "S q",
            "s q",
            "T a",
            "t e",
            "Eq u",
            "K i",
            "O r",
            "P o",
            "R h",
            "R ect",
            "a n",
            "b us",
            "g o",
            "g ra",
            "i lateral",
            "m bus",
            "o centerOfTriangle",
            "o gra",
            "o mbus",
            "r oid",
            "Of Sector",
            "ng ent",
            "Is Me",
            "Is Bisector",
            "Is DiameterOfCircle",
            "Is Perpendicular",
            "Is Ta",
            "Is Or",
            "ua re",
            "re OfCircle",
            "Ra di",
            "tio n",
            "SimilarBetween Triangle",
            "SimilarBetween Quadrilateral",
            "SimilarBetween Arc",
            "CongruentBetween Triangle",
            "CongruentBetween Quadrilateral",
            "CongruentBetween Arc",
            "di an",
            "Area OfTriangle",
            "Area OfQuadrilateral",
            "Area OfCircle",
            "Area OfSector",
            "PerimeterOf Triangle",
            "PerimeterOf Quadrilateral",
            "PerimeterOf Circle",
            "PerimeterOf Sector",
            "Right Trapezoid",
            "th ocenterOfTriangle",
            "RatioOfSimilar Triangle",
            "RatioOfSimilar Quadrilateral",
            "RatioOfSimilar Arc",
            "Isosceles Triangle",
            "Isosceles Trapezoid",
            "Isosceles RightTriangle",
            "us OfCircle",
            "IsCent roid",
            "IsCent reOfCircle",
            "IsIn centerOfTriangle",
            "IsIn centerOfQuadrilateral",
            "MirrorSimilarBetween Triangle",
            "MirrorSimilarBetween Quadrilateral",
            "MirrorCongruentBetween Triangle",
            "MirrorCongruentBetween Quadrilateral",
            "RatioOfMirrorSimilar Triangle",
            "RatioOfMirrorSimilar Quadrilateral",
            "IsMidpoint OfArc",
            "IsMidpoint OfLine",
            "Bisector OfLine",
            "Height OfTriangle",
            "Height OfQuadrilateral",
            "Length OfArc",
            "Length OfLine",
            "Parallel BetweenLine",
            "Parallel ogra",
            "IsCircum centerOfTriangle",
            "IsCircum centerOfQuadrilateral",
            "IsMidsegment OfTriangle",
            "IsMidsegment OfQuadrilateral",
            "Measure OfArc",
            "Measure OfAngle",
            "Perpendicular BetweenLine",
            "IsAltitude OfTriangle",
            "IsAltitude OfQuadrilateral",
            "Sq uare",
            "Equ ilateral",
            "Ki te",
            "Rh ombus",
            "Rect angle",
            "ngent OfCircle",
            "IsMe dian",
            "IsBisector OfAngle",
            "IsPerpendicular BisectorOfLine",
            "IsTa ngentOfCircle",
            "IsOr thocenterOfTriangle",
            "Radi usOfCircle",
            "IsCentroid OfTriangle",
            "Parallelogra m",
            "Equilateral Triangle",
            "IsMedian OfTriangle",
            "A d",
            "M o",
            "M u",
            "P oint",
            "S h",
            "S u",
            "V al",
            "a g",
            "a pe",
            "c o",
            "c irc",
            "c tion",
            "i m",
            "l l",
            "l y",
            "n s",
            "r t",
            "t ru",
            "u e",
            "x t",
            "ua tion",
            "Si n",
            "Co s",
            "Co circ",
            "Co ll",
            "ine ar",
            "Di v",
            "Eq uation",
            "sq rt",
            "Sq rt",
            "Ta n",
            "te xt",
            "Equ al",
            "Po w",
            "Po ly",
            "go n",
            "go al",
            "Ad d",
            "Mo d",
            "Mu l",
            "Sh ape",
            "Su b",
            "Val ue",
            "ag e",
            "co ns",
            "im age",
            "tru ction",
            "Cocirc ular",
            "Coll inear",
            "Poly gon",
            "cons truction",
            "construction _cdl",
            "text _cdl",
            "image _cdl",
            "goal _cdl"
        ]
    }
}